{
  "data": [
    {
      "caption": "cnn.com",
      "description": " ",
      "message": "The Facebook founder has apologized for the Cambridge Analytica scandal in full-page advertisements appearing in British and US newspapers",
      "link": "https://cnn.it/2DUbSLT",
      "message_tags": [
        {
          "id": "20531316728",
          "name": "Facebook",
          "type": "page",
          "offset": 4,
          "length": 8
        }
      ],
      "picture": "https://external.xx.fbcdn.net/safe_image.php?d=AQAS2M1AF2Bx-5zZ&w=130&h=130&url=https%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F180321140952-02-mark-zuckerberg-lead-image-super-tease.jpg&cfs=1&sx=170&sy=0&sw=619&sh=619&_nc_hash=AQAVcQYOOSZdLpAy",
      "coordinates": {
      },
      "name": "Mark Zuckerberg says sorry for 'breach of trust' in full-page newspaper ads",
      "created_time": "2018-03-26T00:15:03+0000",
      "comments": {
        "data": [
          {
            "created_time": "2018-03-26T00:17:24+0000",
            "message": "People should file a class action law suit for a breach of trust against Facebook CEO Mark Zuckerberg.",
            "id": "10158173364551509_10158173373726509"
          },
          {
            "created_time": "2018-03-26T00:26:35+0000",
            "message": "I like Mark Zuckerberg, but sorry doesn't cut it.  Now I know why I get a lot of scammer calls, etc.  I downloaded my FB info and it's unbelievable who has it.  I'm disgusted by it.  I'm deleting my page tomorrow (to give time to let others know). I'm done with FB.",
            "id": "10158173364551509_10158173395011509"
          },
          {
            "created_time": "2018-03-26T00:16:30+0000",
            "message": "Apologies are great, but a privacy policy is only as good as the code it's written in. The reality is if you don't want people to know your private information, don't post it on the public internet.",
            "id": "10158173364551509_10158173371451509"
          },
          {
            "created_time": "2018-03-26T00:20:06+0000",
            "message": "I WISH FB would just go away . Nothing but trouble and drama.  I never seen so many fights and arguments",
            "id": "10158173364551509_10158173381606509"
          },
          {
            "created_time": "2018-03-26T00:20:15+0000",
            "message": "Trump wrote an Executive Order overturning Obama regulations on what internet companies can do with your personal information...so what is the difference?",
            "id": "10158173364551509_10158173382121509"
          },
          {
            "created_time": "2018-03-26T00:24:57+0000",
            "message": "What, he couldn't apologize on Facebook? No one reads newspapers anymore, but the to someone once said that The Newspaper is the old folks Internet.",
            "id": "10158173364551509_10158173391346509"
          },
          {
            "created_time": "2018-03-26T00:16:04+0000",
            "message": "And yet Congress voted to repeal the FCC's broadband privacy protections, Allowing AT&T, Comcast, Time Warner, Sprint and Verizon to sell your personal data like web browsing history without prior consent.",
            "id": "10158173364551509_10158173369591509"
          },
          {
            "created_time": "2018-03-26T00:20:40+0000",
            "message": "Sorry I made millions of dollars selling your private info and letting you be used as guinea pigs for experiments.",
            "id": "10158173364551509_10158173383131509"
          },
          {
            "created_time": "2018-03-26T00:21:25+0000",
            "message": "I forgive  you. Like I always say, you’re not holding any of us hostage on fb, and I don’t believe anyone can monitor the web completely. My choice to be here. Don’t like it?...leave!✌🏽",
            "id": "10158173364551509_10158173384761509"
          },
          {
            "created_time": "2018-03-26T00:21:27+0000",
            "message": "If you don’t want to take responsibility, close up shop, give the money to the poor and move on, someone else will start another Social media that will take your place, and if they pull the same bs they should move on also. Facebook affects everyone and everyone’s life, man up or move on Zuck.",
            "id": "10158173364551509_10158173384926509"
          },
          {
            "created_time": "2018-03-26T00:38:15+0000",
            "message": "Hey Mark, why don't you show us just how sorry you truly are.  Show us your books to prove you were not paid for \"the breach of trust\" as you prefer to call it.  I prefer to call it downright blatant violation of users personal information to aide & abet Cambridge Analytica in gathering said information for others personal gain.    Perhaps it is time to dump Facebook.",
            "id": "10158173364551509_10158173418676509"
          },
          {
            "created_time": "2018-03-26T00:25:29+0000",
            "message": "So people who have voluntarily been giving out ALL of their personal info from the day they first logged onto the internet are upset that someone used their data???? FYI, not the first or last time your data is being used. If people are really this brain dead im scared for the present let alone the future.....",
            "id": "10158173364551509_10158173392451509"
          },
          {
            "created_time": "2018-03-26T00:34:44+0000",
            "message": "1. He addresses only the European and American users.",
            "id": "10158173364551509_10158173409371509"
          },
          {
            "created_time": "2018-03-26T00:20:51+0000",
            "message": "No he's not and he still hasn't told anybody who these people are that their information was given out that's what he should be talking about where's the letter in the mail sorry he's not getting it",
            "id": "10158173364551509_10158173383501509"
          },
          {
            "created_time": "2018-03-26T00:32:40+0000",
            "message": "But what compensation will he be giving people for having their data stolen (ie: sold)??? A hefty class,action lawsuit might take some of the starch out of his humongous profits.....",
            "id": "10158173364551509_10158173406056509"
          },
          {
            "created_time": "2018-03-26T00:26:52+0000",
            "message": "Glad he apologized, but our privacy has been infringed upon. We need recognizable and definitive change to prevent these trolls from derailing our democracy.",
            "id": "10158173364551509_10158173395386509"
          },
          {
            "created_time": "2018-03-26T00:39:41+0000",
            "message": "If sorry fixed everything we'd be a better world; he's sorry all the way to the bank.  That's why FB stock is so valuable.",
            "id": "10158173364551509_10158173421676509"
          },
          {
            "created_time": "2018-03-26T00:38:30+0000",
            "message": "Mark apology accepted,you have my full support.Things happen in life we'll get through this.You have created so many memories for so many ppl.We are not going to turn our backs on you!!",
            "id": "10158173364551509_10158173419271509"
          },
          {
            "created_time": "2018-03-26T00:31:57+0000",
            "message": "Oh the irony.....when the entire world gives up newspapers and resorts to news on Facebook and their founder takes out an advert on print media.",
            "id": "10158173364551509_10158173404741509"
          },
          {
            "created_time": "2018-03-26T00:27:29+0000",
            "message": "too bad newspaper circulation is such a small percentage of the population... how about using television that actually reaches a large audience ?",
            "id": "10158173364551509_10158173396456509"
          },
          {
            "created_time": "2018-03-26T00:40:27+0000",
            "message": "Isn’t the whole point of using a “free” service like FB, is that you’re surrendering your private information?   I must be missing something.",
            "id": "10158173364551509_10158173424711509"
          },
          {
            "created_time": "2018-03-26T00:42:07+0000",
            "message": "What info was taken of mine on FB  ? That I like funny animals and certain social issues? What the hell is so important  if someone finds that out a few things about my likes on FB ? Who cares? I don't ...",
            "id": "10158173364551509_10158173427741509"
          },
          {
            "created_time": "2018-03-26T00:19:54+0000",
            "message": "There should be a law suit on facebook. Or every user gets 1 stock of facebook.  Or something for this breach. Im srry dont work for me.",
            "id": "10158173364551509_10158173380276509"
          },
          {
            "created_time": "2018-03-26T00:27:39+0000",
            "message": "Has anyone ever noticed Zuckerberg’s flat “affect”... while he may be creative and brilliant in creating a “product”...I think a lot of social cues and nuances are lost on Zuckerberg.  He knows he is making a lot of money- but I sincerely doubt he understands intuitively why any part of what he is doing is wrong.",
            "id": "10158173364551509_10158173396911509"
          },
          {
            "created_time": "2018-03-26T00:37:47+0000",
            "message": "Jennifer A Brantley too bad he apologizes in print, now your body language guru can’t tell us if it’s genuine or not based on the hoodie positioning.",
            "id": "10158173364551509_10158173417991509"
          }
        ],
        "paging": {
          "cursors": {
            "before": "Mjky",
            "after": "MjY3"
          },
          "next": "https://graph.facebook.com/v2.12/5550296508_10158173364551509/comments?access_token=EAACEdEose0cBAEt6ahsqjF3rNpetbaMimy2HHZAsKZAmuXwYMpJ83Bw1yEGWwiW9vgsHJ08XnWzkdkmJAHXF4n8gNBTOVallsTuf0AWiE5mx748kaCMtV5K6mJfnIHkxc5uylUyRpYLknemjufnxcHCtwENd8DziZBAdiY9R2Gqm1ZCX3exaPF05cj8ZBBhoZD&pretty=0&limit=25&after=MjY3"
        }
      },
      "id": "5550296508_10158173364551509_testing"
    },
    {
      "caption": "cnn.com",
      "description": " ",
      "message": "\"How about kids instead of looking to someone else to solve their problem, do something about maybe taking CPR classes or trying to deal with situations that when there is a violent shooter that you can actually respond to that,\" the former Pennsylvania GOP senator said",
      "link": "https://cnn.it/2DTXnYl",
      "picture": "https://external.xx.fbcdn.net/safe_image.php?d=AQC52Yj3UTjCNB8s&w=130&h=130&url=https%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F171108110215-rick-santorum-super-tease.jpg&cfs=1&sx=228&sy=0&sw=619&sh=619&_nc_hash=AQDPxo0WAD3FvanK",
      "coordinates": {
      },
      "name": "Rick Santorum says kids should take CPR classes instead of calling for gun laws",
      "created_time": "2018-03-25T23:45:01+0000",
      "comments": {
        "data": [
          {
            "created_time": "2018-03-25T23:57:23+0000",
            "message": "As a Canadian, and I know I will get backlash for saying this because I “should keep my opinions to myself” ,BUT, I can’t believe what I am seeing in the news about all of this.  These kids have so much courage and they are the only ones trying to make a change.  Not the politicians, but kids.  They seem like the adults to me and the adults, aka politicians and gun toting maniacs, are responding like children.  What is going on down there? Smh.  Btw, how in the world is one supposed to perform CPR when they have bullets being sprayed at them? Wow 😳🙄",
            "id": "10158173281506509_174683006674971"
          },
          {
            "created_time": "2018-03-25T23:48:26+0000",
            "message": "I can’t believe how many comments I see from moron adults in these posts that say “Get out of these kids way, they’re going to take over and fix everything!”  How weak do you have to be when you’re willing to submit to teenagers?",
            "id": "10158173281506509_10158173292666509"
          },
          {
            "created_time": "2018-03-25T23:51:16+0000",
            "message": "Great answer that deals with the problem of mass shooting! Other suggestions that might help: take  long walks, write some poetry, eat less candy, enroll into embroidery course and similar great ideas!",
            "id": "10158173281506509_10158173303596509"
          },
          {
            "created_time": "2018-03-25T23:57:01+0000",
            "message": "Oh the desperation. When faced with a grassroots movement of kids, who's sole motivation is to encourage legislation so other kids won't have to worry about surviving a school shooting, he tries to criticize their noble effort is selfish and lazy. He's has no moral ground to stand on and no argument against their efforts. Ignore him and vote the rest of them out.",
            "id": "10158173281506509_174682803341658"
          },
          {
            "created_time": "2018-03-25T23:47:23+0000",
            "message": "Typical Republican response, they are shaking in the booties cause they KNOW that these young adults will be VOTERS very very soon.....and most won't vote for them",
            "id": "10158173281506509_10158173288501509"
          },
          {
            "created_time": "2018-03-25T23:46:43+0000",
            "message": "If Santorum needed CPR, the students should stand there and watch him choke on his aspirations and tell him to enjoy hell!",
            "id": "10158173281506509_10158173285966509"
          },
          {
            "created_time": "2018-03-25T23:47:39+0000",
            "message": "They aren't looking for someone else to solve their problem, they are demanding that law makers DO THEIR JOB and protect them. Keep doing nothing, Rick. These kids will be able to vote very soon.",
            "id": "10158173281506509_10158173289446509"
          },
          {
            "created_time": "2018-03-25T23:51:01+0000",
            "message": "Santorum is scared to death of our youth becoming of age to vote! The GOP and NRA are going to take a massive hit the next several cycles.",
            "id": "10158173281506509_10158173302861509"
          },
          {
            "created_time": "2018-03-25T23:47:16+0000",
            "message": "I'm not an expert. But I'm pretty sure that it would be difficult to perform CPR while someone is firing a gun at me.",
            "id": "10158173281506509_10158173288056509"
          },
          {
            "created_time": "2018-03-25T23:46:18+0000",
            "message": "Because CPR revives someone when their blood is all over the floor and they have 10 bullets in their torso.",
            "id": "10158173281506509_10158173284766509"
          },
          {
            "created_time": "2018-03-25T23:57:33+0000",
            "message": "Mr. Santorum, these kids aren’t looking for someone else to solve their problems. They are showing more maturity and responsibility than ",
            "id": "10158173281506509_543182112718324"
          },
          {
            "created_time": "2018-03-25T23:48:09+0000",
            "message": "When adults refuse to think, kids must be called to cover their shame. All they can do is to vote them out, kids should demand their parents vote for their choice if they truly love them.",
            "id": "10158173281506509_10158173291331509"
          },
          {
            "created_time": "2018-03-25T23:46:15+0000",
            "message": "The ignorance that can come from some of these representatives is utterly astonishing.",
            "id": "10158173281506509_10158173284631509"
          },
          {
            "created_time": "2018-03-25T23:46:03+0000",
            "message": "You got to love today’s Republicans. Anything to deflect from the topic at-hand.",
            "id": "10158173281506509_10158173284171509"
          },
          {
            "created_time": "2018-03-25T23:47:26+0000",
            "message": "It's kinda hard to deliver rescue breaths to someone bleeding from the mouth and with more holes in them than they should have..",
            "id": "10158173281506509_10158173288786509"
          },
          {
            "created_time": "2018-03-25T23:46:38+0000",
            "message": "Of course a republican would say something like this instead of actually doing anything these kids are asking for typical GOP",
            "id": "10158173281506509_10158173285691509"
          },
          {
            "created_time": "2018-03-25T23:46:42+0000",
            "message": "Why fix the problem where it starts when we can just wait for the end where teenagers have to try to revive their friends and classmates on their own",
            "id": "10158173281506509_10158173285886509"
          },
          {
            "created_time": "2018-03-25T23:49:10+0000",
            "message": "It's typical to take CPR in Health classes  in High School, so what's his point again? Just mad because the kids have stepped up & are speaking nothing but the truth!",
            "id": "10158173281506509_10158173295571509"
          },
          {
            "created_time": "2018-03-25T23:48:37+0000",
            "message": "Yep, CPR is known to save your life if you take a bullet to the brain....wtf? Yes, by all means do learn CPR but please don't say knowing CPR will stop school shootings. That is a false equivalency and trivializes the issue at hand - kids are dying in schools, and we should find a way to stop it from happening.",
            "id": "10158173281506509_10158173293476509"
          },
          {
            "created_time": "2018-03-25T23:49:20+0000",
            "message": "Yes, because those 1st graders killed at Sandy Hook should have known how to do CPR? Because that would have stopped the assault rifle used to kill them?  Oh, and how about it being the job of adults to protect children.  I’m pretty sure kids in elementary school, middle school, and (shocker) even high school are still children.  How about Mr. Santorum and all of the adults actually take responsibility and accept the fact that we have failed in keeping our children safe.....in school.....where they shouldn’t have to worry about guns.",
            "id": "10158173281506509_10158173296816509"
          },
          {
            "created_time": "2018-03-25T23:46:50+0000",
            "message": "Regardless of how it is done, the point is to prevent mass shootings not to train people how to help the wounded.",
            "id": "10158173281506509_10158173286401509"
          },
          {
            "created_time": "2018-03-25T23:49:50+0000",
            "message": "Hey CNN, remove this dimwitted dolt from your list of commentators.  Today's comment on CPR is possible the dumbest and most insulting things I've heard in a long, long time.  And in these times, that says a lot.",
            "id": "10158173281506509_10158173298566509"
          },
          {
            "created_time": "2018-03-25T23:48:59+0000",
            "message": "WTF! How about our children don't have to deal with that horror! How about we do something to prevent it. Like Joseph Strong said above, CPR doesn't do anything for a gunshot! I'm horrified by the ignorant adult in our nation",
            "id": "10158173281506509_10158173294806509"
          },
          {
            "created_time": "2018-03-25T23:57:46+0000",
            "message": "CPR makes gunshot wounds more deadly by literally pumping blood around the body... imagine if you had an open wound and were pumping blood out do you think that would save someone’s life?",
            "id": "10158173281506509_174683336674938"
          },
          {
            "created_time": "2018-03-25T23:49:35+0000",
            "message": "\"How about corporations instead of looking to someone else to solve their problem, do something about maybe stop asking for tax cuts or trying to deal with situations that when there is a problem that you can actually respond and not have lobbyist paying people like to pass laws that protects them while killing men, women, and children",
            "id": "10158173281506509_10158173297781509"
          }
        ],
        "paging": {
          "cursors": {
            "before": "MzYzNwZDZD",
            "after": "MzYxMgZDZD"
          },
          "next": "https://graph.facebook.com/v2.12/5550296508_10158173281506509/comments?access_token=EAACEdEose0cBAEt6ahsqjF3rNpetbaMimy2HHZAsKZAmuXwYMpJ83Bw1yEGWwiW9vgsHJ08XnWzkdkmJAHXF4n8gNBTOVallsTuf0AWiE5mx748kaCMtV5K6mJfnIHkxc5uylUyRpYLknemjufnxcHCtwENd8DziZBAdiY9R2Gqm1ZCX3exaPF05cj8ZBBhoZD&pretty=0&limit=25&after=MzYxMgZDZD"
        }
      },
      "id": "5550296508_10158173281506509_testing"
    }
  ],
  "paging": {
    "cursors": {
      "before": "Q2c4U1pXNTBYM0YxWlhKNVgzTjBiM0o1WDJsa0R4NDFOVFV3TWprMk5UQTRPamd6TnpFMk9UWXpNRE13T1RJME9UYzBPVElQREdGd2FWOXpkRzl5ZAVY5cFpBOGNOVFUxTURJNU5qVXdPRjh4TURFMU9ERTNNek0yTkRVMU1UVXdPUThFZAEdsdFpRWmF1RHVIQVE9PQZDZD",
      "after": "Q2c4U1pXNTBYM0YxWlhKNVgzTjBiM0o1WDJsa0R4NDFOVFV3TWprMk5UQTRPakV6T0RreU1qa3lNVGt6TVRrek9UQXpPRElQREdGd2FWOXpkRzl5ZAVY5cFpBOGNOVFUxTURJNU5qVXdPRjh4TURFMU9ERTNNekk0TVRVd05qVXdPUThFZAEdsdFpRWmF1RFI5QVE9PQZDZD"
    },
    "next": "https://graph.facebook.com/v2.12/5550296508/feed?access_token=EAACEdEose0cBAEt6ahsqjF3rNpetbaMimy2HHZAsKZAmuXwYMpJ83Bw1yEGWwiW9vgsHJ08XnWzkdkmJAHXF4n8gNBTOVallsTuf0AWiE5mx748kaCMtV5K6mJfnIHkxc5uylUyRpYLknemjufnxcHCtwENd8DziZBAdiY9R2Gqm1ZCX3exaPF05cj8ZBBhoZD&pretty=0&fields=caption%2Cdescription%2Cmessage%2Clink%2Cmessage_tags%2Cpicture%2Ccoordinates%2Cname%2Ccreated_time%2Ccomments&limit=2&after=Q2c4U1pXNTBYM0YxWlhKNVgzTjBiM0o1WDJsa0R4NDFOVFV3TWprMk5UQTRPakV6T0RreU1qa3lNVGt6TVRrek9UQXpPRElQREdGd2FWOXpkRzl5ZAVY5cFpBOGNOVFUxTURJNU5qVXdPRjh4TURFMU9ERTNNekk0TVRVd05qVXdPUThFZAEdsdFpRWmF1RFI5QVE9PQZDZD"
  }
}
